note-swagger.org

#+SETUPFILE: setup.org
#+TITLE: swagger 在线api文档

* note-swagger
  sudo yum install docker
  sudo systemctl start docker
  sudo systemctl enable docker
** base
   良好的文档
文档应该是规范的API的重要的组成部分，没有文档的API是难以给他人使用的，也是不利于维护的。

其它
使用 OAuth2.0 鉴权

尽量使用JSON作为返回的数据格式

限流

对应上述规则，我们并不能保证其它的API提供者也会遵守，特别是文档，有很大一部分API提供者给出的文档是pdf或者word文档，这是因为在API的迭代开发过程中，文档更新会比较麻烦。

swagger帮API使用者和开发者纠正了这个问题。
** node install
   nvm install
   https://www.digitalocean.com/community/tutorials/how-to-install-node-js-on-a-centos-7-server
** swagger editor
   http://editor.swagger.io
** swagger ui
** Swagger Codegen
*** 
    
