note-swagger.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-13 Tue 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>swagger 在线api文档</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">swagger 在线api文档</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb38062">note-swagger</a>
<ul>
<li><a href="#orga80f548">base</a></li>
<li><a href="#org924046d">node install</a></li>
<li><a href="#orgc2e28d0">swagger editor</a></li>
<li><a href="#orga51835b">swagger ui</a></li>
<li><a href="#org9f52d7a">Swagger Codegen</a>
<ul>
<li><a href="#orgfddf90b"></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb38062" class="outline-2">
<h2 id="orgcb38062">note-swagger</h2>
<div class="outline-text-2" id="text-orgcb38062">
<p>
sudo yum install docker
sudo systemctl start docker
sudo systemctl enable docker
</p>
</div>
<div id="outline-container-orga80f548" class="outline-3">
<h3 id="orga80f548">base</h3>
<div class="outline-text-3" id="text-orga80f548">
<p>
   良好的文档
文档应该是规范的API的重要的组成部分，没有文档的API是难以给他人使用的，也是不利于维护的。
</p>

<p>
其它
使用 OAuth2.0 鉴权
</p>

<p>
尽量使用JSON作为返回的数据格式
</p>

<p>
限流
</p>

<p>
对应上述规则，我们并不能保证其它的API提供者也会遵守，特别是文档，有很大一部分API提供者给出的文档是pdf或者word文档，这是因为在API的迭代开发过程中，文档更新会比较麻烦。
</p>

<p>
swagger帮API使用者和开发者纠正了这个问题。
</p>
</div>
</div>
<div id="outline-container-org924046d" class="outline-3">
<h3 id="org924046d">node install</h3>
<div class="outline-text-3" id="text-org924046d">
<p>
nvm install
<a href="https://www.digitalocean.com/community/tutorials/how-to-install-node-js-on-a-centos-7-server">https://www.digitalocean.com/community/tutorials/how-to-install-node-js-on-a-centos-7-server</a>
</p>
</div>
</div>
<div id="outline-container-orgc2e28d0" class="outline-3">
<h3 id="orgc2e28d0">swagger editor</h3>
<div class="outline-text-3" id="text-orgc2e28d0">
<p>
<a href="http://editor.swagger.io">http://editor.swagger.io</a>
</p>
</div>
</div>
<div id="outline-container-orga51835b" class="outline-3">
<h3 id="orga51835b">swagger ui</h3>
</div>
<div id="outline-container-org9f52d7a" class="outline-3">
<h3 id="org9f52d7a">Swagger Codegen</h3>
<div class="outline-text-3" id="text-org9f52d7a">
</div>
<div id="outline-container-orgfddf90b" class="outline-4">
<h4 id="orgfddf90b"></h4>
</div>
</div>
</div>
</div>
</body>
</html>